{
  "basics": {
    "name": "Clark Ngo",
    "email": "clarkjasonngo@yahoo.com",
    "phone": "",
    "website": "https://clarkngo.github.io",
    "summary": "AI Software Engineer at City University of Seattle. Passionate about building robust, user-focused solutions in AI, cloud, and full-stack development.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Seattle",
      "countryCode": "US",
      "region": "Washington"
    },
    "profiles": [
      {
        "network": "Google Scholar",
        "username": "",
        "url": "https://scholar.google.com/citations?user=m5MIf0AAAAAJ&hl=en"
      },
      {
        "network": "GitHub",
        "username": "clarkngo",
        "url": "https://github.com/clarkngo"
      }
    ]
  },
  "work": [
    {
      "position": "AI Software Engineer",
      "company": "City University of Seattle",
      "location": "Seattle, WA",
      "startDate": "2024-01",
      "endDate": "Present",
      "summary": "Built a modular conversational AI pipeline using Retrieval-Augmented Generation (RAG), alongside a custom implementation of Model Context Protocol (MCP) to support dynamic memory, token window control, and context persistence.",
      "highlights": [
        "Enabled dynamic context management in multi-turn LLM workflows by integrating Claude Desktop with an MCP server and testing interoperability with other MCP-aligned tools.",
        "Designed and deployed RAG applications integrating LLMs (Gemma via Ollama) with ChromaDB for intelligent search and recommendations. Built CI/CD pipelines with GitHub Actions and deployed on Amazon EC2.",
        "Built a secure mobile banking prototype using Flask and React Native simulating key modules like fund transfer, integrated with front-end review workflows in Jupyter Notebooks.",
        "Developed a lightweight Python-based ticketing platform for IT support simulation, designed for student use in audit and walkthrough exercises (IEEE 1028).",
        "Engineered a visual feedback dashboard using React and Chart.js, connected to a Flask backend with live risk scoring, CRUD operations, and configurable service health endpoints.",
        "Created interactive React Native apps such as a zombie shooter and quiz combat game to teach state management, local storage (AsyncStorage), and dynamic UI logic using hooks."
      ]
    },
    {
      "position": "IT Consultant",
      "company": "Liberty Paper Inc",
      "location": "Quezon, Philippines",
      "startDate": "2023-11",
      "endDate": "2023-12",
      "summary": "Brought in as a strategic advisor to identify optimization opportunities and modernize existing processes, tools, and IT infrastructure—enhancing operational efficiency and scalability.",
      "highlights": [
        "Led key digital transformation initiatives, including a centralized knowledge base to improve information access and cross-team collaboration.",
        "Standardized software development workflows by implementing Git for version control and GitHub as a cloud repository, while modernizing customer service and HR with ServiceDesk for improved request tracking and issue resolution.",
        "Revamped ERP systems with ERPNext to enhance automation and operational efficiency, while upgrading IT infrastructure with VPN and DDNS for stronger security and seamless remote access."
      ]
    },
    {
      "position": "Software Engineer II",
      "company": "eBay Inc",
      "location": "San Jose, CA (Remote)",
      "startDate": "2021-08",
      "endDate": "2023-09",
      "summary": "Recruited to revamp the front-end and back-end of eBay Advertising's Control Center, transforming it into a powerful one-stop application for monitoring ad infrastructure health, analyzing performance, managing incidents, and assessing the impact of experiments and code changes.",
      "highlights": [
        "Cut mean time to identify site-impacting issues from 1 minute to just 10 seconds by scraping data from ServiceNow and internal APIs, storing it in Elasticsearch, and developing JAX-RS CRUD APIs for enhanced data management. Additionally, integrated Kafka for real-time ingestion and streaming of placement metadata.",
        "Delivered a key project 25% ahead of schedule by onboarding experiment metadata, significantly improving visibility into traffic shifts caused by experiments.",
        "Boosted code reusability by reducing duplication from 20% to 5%—implemented Spring microservices to decouple logic from monolithic applications and published shared libraries to JFrog.",
        "Enhanced code quality and reliability, increasing test coverage by 40% through JUnit, Mockito, and Jenkins PR validation, while driving best practices via mentoring, code pairing, and rigorous code reviews.",
        "Technologies used: Java, Spring, Spring Batch, Python, JavaScript, React, Redis, MySQL, Elasticsearch, Git, Docker, Kubernetes, and Jenkins."
      ]
    },
    {
      "position": "Software Engineer",
      "company": "Worldwide American",
      "location": "Cleveland, OH (Remote)",
      "startDate": "2021-01",
      "endDate": "2021-07",
      "summary": "Brought in to design and develop a next-generation basketball platform to enhance game operations and community engagement.",
      "highlights": [
        "Architected and built a scalable platform featuring a shot clock calculator, a hub for basketball clubs, and a rule book fouls hub, optimizing usability for players, coaches, and referees.",
        "Implemented real-time data handling and cloud scalability by integrating AWS S3, EC2, CloudFront, and Route 53, ensuring high availability and performance."
      ]
    },
    {
      "position": "Software Engineer",
      "company": "CloudEagle.AI",
      "location": "San Francisco, CA (Remote)",
      "startDate": "2020-05",
      "endDate": "2020-12",
      "summary": "Recruited to lead the pre-launch of an AI-driven Vendor Management System (VMS), later backed by Y Combinator, revolutionizing vendor selection, performance tracking, and procurement efficiency.",
      "highlights": [
        "Engineered a high-performance Java Spring backend, reducing processing time by 50% for loading customers' SaaS providers into MongoDB, significantly improving data ingestion speed and system efficiency.",
        "Conducted rigorous Okta user assignment API testing using Python scripts across 15 random applications, ensuring seamless access control for 500 unique users.",
        "Validated and maintained a 98%+ accuracy rate in user assignments, reinforcing security and minimizing access inconsistencies.",
        "Technologies used: React, Java, Python, MongoDB, SwaggerUI, Postman, Docker, Jira, AWS S3, AWS EC2, AWS CloudFront, AWS Cognito, and Okta."
      ]
    },
    {
      "position": "Technical Program Manager",
      "company": "City University of Seattle",
      "location": "Seattle, WA",
      "startDate": "2019-01",
      "endDate": "2020-04",
      "summary": "Recruited to lead and scale a high-impact apprenticeship program focused on System Administration, Full-Stack Web Development, and Linux+ Certification, equipping military veterans with in-demand technical skills.",
      "highlights": [
        "Successfully transitioned 40 out of 43 veterans into AWS Teams as Systems Developers through two intensive 17-week training programs, fostering career advancement in cloud computing and software development.",
        "Achieved a 40% reduction in operational costs, saving $72,000 over two years, by redesigning the learning platform and optimizing workloads for maximum efficiency.",
        "Bridged the gap between military service and tech careers, driving workforce transformation through structured mentorship, hands-on training, and real-world application of cloud and development technologies.",
        "Technologies used: Java, MEAN Stack, MongoDB, Express, Angular, Node.js, TypeScript, JavaScript, Python, MySQL, AWS, Linux, and Mendix."
      ]
    },
    {
      "position": "Financial Analyst - Mandarin",
      "company": "S&P Capital IQ",
      "location": "Pasig, Philippines",
      "startDate": "2013-02",
      "endDate": "2016-08",
      "summary": "Consistently achieved an \"A\" performance rating, exceeding expectations in translating 1,166,110 words across 7,230 data issues over three years, ensuring accuracy and efficiency in Financial Information process translation.",
      "highlights": [
        "Pioneered a Business Intelligence translation framework, developing an extensive dictionary of Simplified and Traditional Chinese characters for financial, legal, and medical terminology, improving translation precision and consistency.",
        "Enhanced and maintained Systran dictionaries and other translation tools, ensuring greater accuracy, efficiency, and standardization across financial data translations."
      ]
    },
    {
      "position": "Financial Analyst - Mandarin",
      "company": "Thomson Reuters Corp.",
      "location": "Makati, Philippines",
      "startDate": "2011-09",
      "endDate": "2013-01",
      "summary": "Consistently exceeded performance targets, achieving 130% production efficiency and maintaining 99% data quality, ensuring accuracy and reliability in financial data processing.",
      "highlights": [
        "Extracted and encoded fundamental data from China, Taiwan, Hong Kong, and Thailand-listed companies into the Voyager database, while translating Simplified and Traditional Chinese financial statements into English for global accessibility.",
        "Streamlined client service operations, facilitating service requests and ensuring timely resolution of inquiries from internal and external clients, enhancing service efficiency and satisfaction.",
        "Identified and analyzed database errors, implementing validation checks and process improvements to enhance data accuracy, reduce inefficiencies, and drive automation."
      ]
    }
  ],
  "education": [
    {
      "institution": "City University of Seattle",
      "area": "Master of Business Administration",
      "studyType": "MBA",
      "startDate": "2024-01",
      "endDate": "Present",
      "gpa": null,
      "courses": []
    },
    {
      "institution": "City University of Seattle",
      "area": "Master of Science in Computer Science",
      "studyType": "MSCS",
      "startDate": "2017-06",
      "endDate": "2020-03",
      "gpa": null,
      "courses": []
    },
    {
      "institution": "De La Salle University",
      "area": "Bachelor of Science in Commerce, Major in Management of Financial Institutions",
      "studyType": "BS Commerce",
      "startDate": "2007-05",
      "endDate": "2010-04",
      "gpa": null,
      "courses": []
    }
  ],
  "skills": [],
  "languages": [],
  "interests": [],
  "references": [],
  "publications": [
    {
      "name": "Paper Title Number 1",
      "publisher": "Journal 1",
      "releaseDate": "2009-10-01",
      "website": "http://academicpages.github.io/files/paper1.pdf",
      "summary": "This paper is about the number 1. The number 2 is left for future work."
    },
    {
      "name": "Paper Title Number 2",
      "publisher": "Journal 1",
      "releaseDate": "2010-10-01",
      "website": "http://academicpages.github.io/files/paper2.pdf",
      "summary": "This paper is about the number 2. The number 3 is left for future work."
    },
    {
      "name": "Paper Title Number 3",
      "publisher": "Journal 1",
      "releaseDate": "2015-10-01",
      "website": "http://academicpages.github.io/files/paper3.pdf",
      "summary": "This paper is about the number 3. The number 4 is left for future work."
    },
    {
      "name": "Paper Title Number 4",
      "publisher": "GitHub Journal of Bugs",
      "releaseDate": "2024-02-17",
      "website": "http://academicpages.github.io/files/paper3.pdf",
      "summary": "This paper is about fixing template issue #693."
    }
  ],
  "presentations": [
    {
      "name": "Talk 1 on Relevant Topic in Your Field",
      "event": "UC San Francisco, Department of Testing",
      "date": "2012-03-01",
      "location": "San Francisco, CA, USA",
      "description": ""
    },
    {
      "name": "Tutorial 1 on Relevant Topic in Your Field",
      "event": "UC-Berkeley Institute for Testing Science",
      "date": "2013-03-01",
      "location": "Berkeley, CA, USA",
      "description": ""
    },
    {
      "name": "Talk 2 on Relevant Topic in Your Field",
      "event": "London School of Testing",
      "date": "2014-02-01",
      "location": "London, UK",
      "description": ""
    },
    {
      "name": "Conference Proceeding talk 3 on Relevant Topic in Your Field",
      "event": "Testing Institute of America 2014 Annual Conference",
      "date": "2014-03-01",
      "location": "Los Angeles, CA, USA",
      "description": ""
    }
  ],
  "teaching": [
    {
      "course": "Teaching experience 1",
      "institution": "University 1, Department",
      "date": "2014-01-01",
      "role": "Undergraduate course",
      "description": ""
    },
    {
      "course": "Teaching experience 2",
      "institution": "University 1, Department",
      "date": "2015-01-01",
      "role": "Workshop",
      "description": ""
    }
  ],
  "portfolio": [
    {
      "name": "Portfolio item number 1",
      "category": "portfolio",
      "date": "",
      "url": "",
      "description": "Short description of portfolio item number 1<br/><img src='/images/500x300.png'>"
    }
  ],
  "certifications": [
    {
      "name": "AWS Cloud Practitioner",
      "issuer": "Amazon Web Services",
      "date": "2020-12"
    },
    {
      "name": "CompTIA Linux+ ce Certification",
      "issuer": "CompTIA",
      "date": "2020-04"
    },
    {
      "name": "Software Engineering",
      "issuer": "The Firehose Project",
      "date": "2019"
    },
    {
      "name": "Ableton Specialist",
      "issuer": "Berklee College of Music",
      "date": "2016"
    }
  ]
}